pillar/exp_simpleCar/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        nFaces          64;
        startFace       25506;
    }
    outlet
    {
        type            patch;
        nFaces          63;
        startFace       25570;
    }
    upperWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          225;
        startFace       25633;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       25858;
    }
    body
    {
        type            wall;
        inGroups        1(wall);
        nFaces          195;
        startFace       26058;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          25880;
        startFace       26253;
    }
    airIntake
    {
        type            patch;
        nFaces          1;
        startFace       52133;
    }
)

// ************************************************************************* //
